tienda/app/controllers/articulos_controller.rb

SELECT * FROM "articulos" LIMIT 10 OFFSET 0
---
  def index
    @articulos = Articulo.paginate(:page => params[:page], :per_page => 10)

SELECT * FROM "articulos" WHERE ("articulos"."id" = 1)
---
  def show
    @articulo = Articulo.find(params[:id])

SELECT * FROM "articulos" WHERE ("articulos"."id" = 2)
---
  def edit
    @articulo = Articulo.find(params[:id])

INSERT INTO "articulos" ("photo1_content_type", "photo4_content_type", "photo4_file_size", "updated_at", "photo_file_name", "photo_file_size", "nombre", "descripcion", "photo2_content_type", "photo4_updated_at", "photo3_updated_at", "photo_updated_at", "photo2_file_name", "photo2_updated_at", "photo1_updated_at", "photo2_file_size", "precio", "cantidad", "photo_content_type", "photo3_file_size", "photo1_file_name", "photo1_file_size", "photo3_content_type", "photo3_file_name", "created_at", "photo4_file_name") VALUES(NULL, NULL, NULL, '2009-07-28 15:47:25', NULL, NULL, '', '', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2009-07-28 15:47:25', NULL)
---
  def create
    @articulo = Articulo.create(params[:articulo])

SELECT * FROM "articulos" WHERE ("articulos"."id" = 2)
UPDATE "articulos" SET "descripcion" = 'xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx', "updated_at" = '2009-07-28 21:33:46' WHERE "id" = 2
---
  def update
    @articulo = Articulo.find(params[:id])

    respond_to do |format|
      if @articulo.update_attributes(params[:articulo])

SELECT * FROM "articulos" WHERE ("articulos"."id" = 1)
DELETE FROM "articulos" WHERE "id" = 1
---
  def destroy
    @articulo = Articulo.find(params[:id])
    @articulo.destroy