tienda/app/controllers/store_controller.rb

SELECT * FROM "articulos" ORDER BY nombre
---
  def index
     @articulos = Articulo.find_products_for_sale

SELECT * FROM "articulos" WHERE ("articulos"."id" = 2)
---
 def add_to_cart
    p = Articulo.find(params[:id])

SELECT * FROM "articulos" ORDER BY nombre
---
 def comprar
    @articulos = Articulo.find_products_for_sale